"""
 * @file   : www.py
 * @time   : 20:35
 * @date   : 2022/3/24
 * @mail   : 9727005@qq.com
 * @creator: ShanDong Xiedali
 * @company: HiLand & RainyTop
"""

# +--------------------------------------------------------------------------
# |::::TIPS::::| 本代码的使用说明
# ---------------------------------------------------------------------------
# 齐头并行遍历。使用zip()函数将多个列表合并为一个元组列表，然后使用for循环齐头并行地向前遍历元素。
# +--------------------------------------------------------------------------

if __name__ == '__main__':
    list1 = [1, 2, 3, ]  # 假设有三个元素 range(1, 4)
    list2 = [4, 5, 6, ]  # 假设有三个元素 range(4, 7)
    list3 = [7, 8, ]  # range(7, 9)

    # 注意缝合后的结果元组的个数与各个列表的元素个数最少的相同
    for i, j, k in zip(list1, list2, list3):
        print(i, j, k)
    pass

# 输出结果：
# 1 4 7
# 2 5 8
