"""
 * @file   : 5.pass关键字的使用技巧.py
 * @time   : 16:55
 * @date   : 2023/6/13
 * @mail   : 9727005@qq.com
 * @creator: ShanDong Xiedali
 * @company: HiLand & RainyTop
"""

"""
没有任何具体意义的 pass 关键在可以出现在 for、if、def的方法等结束位置，标识本代码已经完成。
"""

list_data = ["a", "b", "c"]

# +--------------------------------------------------------------------------
# |::说明·| Python 缺省模式下，因为没有{}等边界符合，所以代码段（尤其是结束部分）看起来比较突兀。
# +--------------------------------------------------------------------------
for key in list_data:
    print(key)

# +--------------------------------------------------------------------------
# |::说明·| 使用没有任何意义的 pass 关键字，在一定程度上可以取代{}等表示边界的符号。
# +--------------------------------------------------------------------------
for key in list_data:
    print(key)
pass
