"""
 * @file   : 02.迭代器和列表的不同.py
 * @time   : 15:22
 * @date   : 2024/2/20
 * @mail   : 9727005@qq.com
 * @creator: ShanDong Xiedali
 * @company: HiLand & RainyTop
"""

# +--------------------------------------------------------------------------
# |::::TIPS::::| 列表和迭代器都可以用于for/in循环，但是它们的“状态性”是不同的
# ---------------------------------------------------------------------------
# 1. 列表是没有状态的，可以多次通过for/in循环来遍历列表，都可以正常显示内容
# 2. 迭代器是有状态的，只能遍历一次，再次遍历就不再显示内容了
# +--------------------------------------------------------------------------

if __name__ == '__main__':
    lst = [1, 2, 3, 4, 5]
    # 1. 列表是没有状态的，可以多次通过for/in循环来遍历列表，都可以正常显示内容
    print("──对可迭代对象进行第1次遍历───────────────────────────────────")
    for _item in lst:
        print(_item)
    pass
    print("──对可迭代对象进行第2次遍历───────────────────────────────────")
    for _item in lst:
        print(_item)
    pass

    print("──分割线───────────────────────────────────")
    print("──分割线───────────────────────────────────")

    # 2. 迭代器是有状态的，只能遍历一次，再次遍历就不再显示内容了
    # 2.0从列表生成迭代器
    itr = iter(lst)
    # 2.1 迭代器只能遍历一次，
    print("──对迭代器进行第1次遍历───────────────────────────────────")
    for _item in itr:
        print(_item)
    pass

    # 2.2 再次遍历迭代器，不会再显示内容
    print("──对迭代器进行第2次遍历───────────────────────────────────")
    for _item in itr:
        print(_item)
    pass
